{
  "Projects": [
    {
      "name": "SmartPantry",
      "logo": "",
      "time": "October 2023",
      "type": "",
      "desription": "During a 36-hour hackathon, my team developed SmartPantry, a mobile application aimed at reducing food waste by helping users manage their groceries more efficiently. Built using Expo React Native and Appwrite, the app allows users to track their ingredients, receive expiration reminders, and get recipe suggestions based on what they have on hand. SmartPantry empowers users to minimize waste and make meal planning easier, aligning with our mission to address the global issue of food waste.",
      "link": "https://github.com/dorawengg/brh25/tree/main",
      "tools": [
        "Expo React Native",
        "Appwrite",
        "TypeScript"
      ]
    },
    {
      "name": "RAG System with Local LLM",
      "time": "2024",
      "type": "Personal Project",
      "desription": "Built a Retrieval-Augmented Generation (RAG) system that allows users to upload and analyze unlimited documents using a locally hosted LLM (Llama3). The system enables efficient document retrieval and context-aware chatbot responses, leveraging FAISS for vector storage and LangChain for seamless integration.",
      "link": "https://github.com/dorawengg/RAG-LLM",
      "tools": [
        "Python",
        "Streamlit",
        "LangChain",
        "Ollama",
        "FAISS",
        "Llama3"
      ]
    },
    {
      "name": "Industrial Technology Research Institute",
      "logo": "",
      "time": "June 2024 - August 2024",
      "type": "",
      "desription": "During my internship at the Industrial Technology Research Institute, I independently developed a locally hosted nursing chatbot using Streamlit and a Retrieval-Augmented Generation (RAG) LLM model. I enhanced the chatbot's performance by processing and analyzing information from an online medical database. Additionally, I trained the RAG model on a remote Linux server to provide more accurate responses and conducted a scoping review of 16 articles focused on speech-to-text and LLM applications in healthcare, aiming to streamline medical documentation processes.",
      "link": "",
      "tools": [
        "Python",
        "Streamlit",
        "LangChain",
        "Ollama",
        "FAISS",
        "Llama3"
      ]
    },
    {
      "name": "AguaClara",
      "logo": "src/img/AguaClaraLogo.webp",
      "time": "February 2023 - Present",
      "type": "",
      "desription": "As the Web Development Lead for AguaClara Cornell, I led the redesign and implementation of the team’s website, which resulted in a 75% increase in page views. I designed a scalable content management system (CMS) using JavaScript and JSON to manage data for over 60 team members. I also authored detailed technical documentation and oversaw the deployment and maintenance of the site, setting up continuous integration to streamline updates and ensure efficient maintenance. \n In my current role as a Backend Developer on the POST subteam, I am working on the integration of  AWS Amplify to enable real-time and offline data synchronization for the backend of AguaDatos, ensuring data reliability in areas with limited network access.",
      "link": "https://aguaclara.cornell.edu",
      "tools": [
        "React",
        "TailwindCSS",
        "AWS Amplify",
        "JavaScript",
        "JSON",
        "Git",
        "Figma"
      ]
    },
    {
      "name": "ConsenCity",
      "logo": "src/img/Glimpse.png",
      "time": "March 2023",
      "type": "",
      "desription": "During a 24-hour hackathon (Big Red Hacks!), my team developed a web application to improve transparency in local government policymaking. Our project, which facilitated public access to policy information, won the best software award for its innovation and impact on civic engagement.",
      "link": "https://github.com/JasonMun7/brh2024",
      "tools": [
        "React",
        "Supabase",
        "TypeScript"
      ]
    },
    {
      "name": "Glimpse",
      "logo": "src/img/Glimpse.png",
      "time": "September 2023 - Present",
      "type": "",
      "desription": "Glimpse is a website/app designed to make it easy for friends to stay connected and updated on each other's lives. By signing up with your friend group, you will receive a monthly email with prompts about your lives. Simply respond to the prompts and share any photos or videos you like. Friends can log into their accounts to view their memories over time and customize prompts.",
      "link": "https://github.com/Glimpse-Dev",
      "tools": [
        "React",
        "React Native",
        "Supabase"
      ]
    }
  ]
}